zjcszn/embeded-lib/4. peripheral drivers/drivers/2. NET & Wireless/7. RFID/fm175xx/FM175XX_STM32_LPCD_V27B_1/INC/FM175XX_REG.h
/* Error Register 							(06) */
#define     JBIT_WRERR              0x40   /*Bit position for Write Access Error. */
#define     JBIT_TEMPERR            0x40   /*Bit position for Temerature Error. */
#define     JBIT_RFERR              0x20   /*Bit position for RF Error. */
#define     JBIT_BUFFEROVFL         0x10   /*Bit position for Buffer Overflow Error. */
#define     JBIT_COLLERR            0x08   /*Bit position for Collision Error. */
#define     JBIT_CRCERR             0x04   /*Bit position for CRC Error. */
#define     JBIT_PARITYERR          0x02   /*Bit position for Parity Error. */
#define     JBIT_PROTERR            0x01   /*Bit position for Protocol Error. */

/* Status 1 Register 						(07) */
#define     JBIT_CRCOK              0x40   /*Bit position for status CRC OK. */
#define     JBIT_CRCREADY           0x20   /*Bit position for status CRC Ready. */
#define     JBIT_IRQ                0x10   /*Bit position for status IRQ is active. */
#define     JBIT_TRUNNUNG           0x08   /*Bit position for status Timer is running. */
#define     JBIT_RFON               0x04   /*Bit position for status RF is on/off. */
#define     JBIT_HIALERT            0x02   /*Bit position for status HiAlert. */
#define     JBIT_LOALERT            0x01   /*Bit position for status LoAlert. */

/* Status 2 Register				    	(08) */
#define     JBIT_TEMPSENSOFF        0x80   /*Bit position to switch Temperture sensors on/off. */
#define     JBIT_I2CFORCEHS         0x40   /*Bit position to forece High speed mode for I2C Interface. */
#define     JBIT_MFSELECTED         0x10   /*Bit position for card status Mifare selected. */
#define     JBIT_CRYPTO1ON          0x08   /*Bit position for reader status Crypto is on. */

/* FIFOLevel Register				    	(0A) */
#define     JBIT_FLUSHFIFO          0x80   /*Clears FIFO buffer if set to 1 */

/* Control Register					    	(0C) */
#define     JBIT_TSTOPNOW           0x80   /*Stops timer if set to 1. */
#define     JBIT_TSTARTNOW          0x40   /*Starts timer if set to 1. */
#define     JBIT_WRNFCIDTOFIFO      0x20   /*Copies internal stored NFCID3 to actual position of FIFO. */
#define     JBIT_INITIATOR          0x10   /*Sets Initiator mode. */

/* BitFraming Register					    (0D) */
#define     JBIT_STARTSEND          0x80   /*Starts transmission in transceive command if set to 1. */

/* BitFraming Register					    (0E) */
#define     JBIT_VALUESAFTERCOLL    0x80   /*Activates mode to keep data after collision. */

/*name FM175XX Bit definitions of Page 1
 *  Below there are useful bit definition of the FM175XX register set of Page 1.*/
/* Mode Register							(11) */
#define     JBIT_MSBFIRST           0x80   /*Sets CRC coprocessor with MSB first. */
#define     JBIT_DETECTSYNC         0x40   /*Activate automatic sync detection for NFC 106kbps. */
#define     JBIT_TXWAITRF           0x20   /*Tx waits until Rf is enabled until transmit is startet, else 
                                                transmit is started immideately. */
#define     JBIT_RXWAITRF           0x10   /*Rx waits until Rf is enabled until receive is startet, else 
                                                receive is started immideately. */
#define     JBIT_POLSIGIN           0x08   /*Inverts polarity of SiginActIrq, if bit is set to 1 IRQ occures
                                                when Sigin line is 0. */
#define     JBIT_MODEDETOFF         0x04   /*Deactivates the ModeDetector during AutoAnticoll command. The settings
                                                of the register are valid only. */

/* TxMode Register							(12) */
#define     JBIT_TXCRCEN            0x80  /*enables the CRC generation during data transmissio. */
#define     JBIT_INVMOD             0x08   /*Activates inverted transmission mode. */
#define     JBIT_TXMIX              0x04   /*Activates TXMix functionality. */

/* RxMode Register							(13) */
#define     JBIT_RXCRCEN            0x80   /*enables the CRC generation during reception.. */
#define     JBIT_RXNOERR            0x08   /*If 1, receiver does not receive less than 4 bits. */
#define     JBIT_RXMULTIPLE         0x04   /*Activates reception mode for multiple responses. */

/* Definitions for Tx and Rx		    (12, 13) */
#define     JBIT_106KBPS            0x00   /*Activates speed of 106kbps. */
#define     JBIT_212KBPS            0x10   /*Activates speed of 212kbps. */
#define     JBIT_424KBPS            0x20   /*Activates speed of 424kbps. */
#define     JBIT_848KBPS            0x30   /*Activates speed of 848kbps. */
#define     JBIT_1_6MBPS            0x40   /*Activates speed of 1.6Mbps. */
#define     JBIT_3_2MBPS            0x50   /*Activates speed of 3_3Mbps. */

#define     JBIT_MIFARE             0x00   /*Activates Mifare communication mode. */
#define     JBIT_NFC                0x01   /*Activates NFC/Active communication mode. */
#define     JBIT_FELICA             0x02   /*Activates FeliCa communication mode. */

#define     JBIT_CRCEN              0x80   /*Activates transmit or receive CRC. */

/* TxControl Register						(14) */
#define     JBIT_INVTX2ON           0x80   /*Inverts the Tx2 output if drivers are switched on. */
#define     JBIT_INVTX1ON           0x40   /*Inverts the Tx1 output if drivers are switched on. */
#define     JBIT_INVTX2OFF          0x20   /*Inverts the Tx2 output if drivers are switched off. */
#define     JBIT_INVTX1OFF          0x10   /*Inverts the Tx1 output if drivers are switched off. */
#define     JBIT_TX2CW              0x08   /*Does not modulate the Tx2 output, only constant wave. */
#define     JBIT_CHECKRF            0x04   /*Does not activate the driver if an external RF is detected.
                                                Only valid in combination with JBIT_TX2RFEN and JBIT_TX1RFEN. */
#define     JBIT_TX2RFEN            0x02   /*Switches the driver for Tx2 pin on. */
#define     JBIT_TX1RFEN            0x01   /*Switches the driver for Tx1 pin on. */

/* TxAuto Register							(15) */
#define     JBIT_AUTORFOFF          0x80   /*Switches the RF automatically off after transmission is finished. */
#define     JBIT_FORCE100ASK        0x40   /*Activates 100%ASK mode independent of driver settings. */
#define     JBIT_AUTOWAKEUP         0x20   /*Activates automatic wakeup of the FM175XX if set to 1. */
#define     JBIT_CAON               0x08   /*Activates the automatic time jitter generation by switching 
                                                on the Rf field as defined in ECMA-340. */
#define     JBIT_INITIALRFON        0x04   /*Activate the initial RF on procedure as defined iun ECMA-340. */
#define     JBIT_TX2RFAUTOEN        0x02   /*Switches on the driver two automatically according to the 
                                                other settings. */
#define     JBIT_TX1RFAUTOEN        0x01   /*Switches on the driver one automatically according to the 
                                                other settings. */

/* Demod Register 							(19) */
#define     JBIT_FIXIQ              0x20   /*If set to 1 and the lower bit of AddIQ is set to 0, the receiving is fixed to I channel.
                                                If set to 1 and the lower bit of AddIQ is set to 1, the receiving is fixed to Q channel. */

